simulacion/08.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-16 Wed 13:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sistemas dinámicos en tiempo continuo</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/res/org.css"/>
<link rel="stylesheet" type="text/css" href="../res/org.css"/>


</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfdef177">1. Sistemas dinámicos en tiempo discreto</a>
<ul>
<li><a href="#org06c6f55">1.1. Propiedades sistemas tiempo discreto (1)</a></li>
<li><a href="#org2f683c4">1.2. Propiedades sistemas tiempo discreto (2)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfdef177" class="outline-2">
<h2 id="orgfdef177"><span class="section-number-2">1</span> Sistemas dinámicos en tiempo discreto</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org06c6f55" class="outline-3">
<h3 id="org06c6f55"><span class="section-number-3">1.1</span> Propiedades sistemas tiempo discreto (1)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Cualquier sistema dinámico puede escribirse como un sistema autónomo de primer
orden definiendo nuevas variables de estado (aumentando la dimensión).
</p>

<p>
Modelo \[x_t = F(x_{t-1})\]
</p>

<p>
Condición Punto Fijo \(x^*\): \[x^* = F(x^*)\]
</p>

<p>
Tipos de Puntos Fijos:
</p>
<ul class="org-ul">
<li>Estable (atractor)</li>
<li>Inestable (repulsor)</li>
<li>Ciclo límite (atractor)</li>
</ul>

<p>
diag
</p>
</div>
</div>

<div id="outline-container-org2f683c4" class="outline-3">
<h3 id="org2f683c4"><span class="section-number-3">1.2</span> Propiedades sistemas tiempo discreto (2)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
5
</p>

<p>
Los sistemas dinámicos lineales tiene un único punto fijo
El comportamiento está determinado por los autovalores y autovectores de la
matriz del sistema.
x1
</p>

<p>
u2
u1
</p>

<p>
unt =
</p>

<p>
x*
</p>



<p>
t
n un0
</p>

<p>
x1
</p>

<ul class="org-ul">
<li>Autovalores reales o complejos</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<tbody>
<tr>
</tr>
</tbody>
</table>

<p>
1 |, | 2 |
</p>

<p>
&lt;1
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<tbody>
<tr>
</tr>
</tbody>
</table>

<p>
1 |, | 2 |
</p>

<p>
&gt;1
</p>



<ul class="org-ul">
<li>Autovalores reales o complejos</li>
</ul>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<tbody>
<tr>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Autovalores complejos</li>
</ul>



<ul class="org-ul">
<li>Autovalores reales</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<tbody>
<tr>
</tr>
</tbody>
</table>


<p>
1|
1|
</p>

<p>
=|
</p>

<p>
&lt; 1, |
</p>



<p>
2|
</p>

<p>
=1
</p>

<p>
2|
</p>

<p>
ATRACTOR
(punto fijo estable)
REPULSOR
(punto fijo inestable)
CICLO LIMITE
</p>

<p>
&gt;1
</p>

<p>
SADDLE POINT
</p>



<p>
Cambio de variables
</p>

<p>
6
</p>

<p>
A veces es conveniente definir un cambio en la variables de estado para
simplificar las ecuaciones del sistema.
Ejemplo: ecuación logística para crecimiento poblacional
</p>

<p>
Logistic Map
</p>




<p>
Comportamiento asintótico sistemas no-lineales
</p>

<p>
7
</p>

<p>
Sistemas Lineales: ya lo vimos (un único punto fijo)
El análisis de la dinamica de sistemas no-lineales es complicado pero lo que
podemos hacer es analizar el comportamiento en un entorno reducido de los
puntos fijos.
</p>





<p>
Comportamiento asintótico sistemas no-lineales
</p>

<p>
8
</p>

<p>
En un entorno reducido, el sistema se comporta como un sistema lineal con
una matriz determinada por el Jacobiano de la función no lineal evaluada en el
punto fijo
</p>

<p>
Sistema Lineal !!!
</p>





<p>
Comportamiento asintótico sistemas no-lineales
</p>



<p>
9
</p>



<p>
Sistemas dinámicos
en tiempo continuo
</p>

<p>
Sistemas dinámicos en tiempo continuo
</p>



<p>
11
</p>



<p>
Sistemas dinámicos en tiempo continuo
</p>

<p>
Ejemplo: Segundo orden
</p>

<p>
Introducimos variable “clock”
</p>



<p>
12
</p>

<p>
Primer orden no-autónomo
(dos dimensiones)
</p>

<p>
Primer orden autónomo
(3 dimensiones)
</p>



<p>
Sistemas dinámicos lineales en tiempo continuo
</p>



<p>
13
</p>



<p>
Simulación de sistemas no-lineales autónomos
en tiempo continuo (discretización)
</p>

<p>
14
</p>

<p>
Método de Euler (MALO!!)
</p>

<p>
Método más preciso: Algoritmo de Runge-Kutta orden 4:
</p>

<p>
Método más eficiente con discretización adaptativa
En MATLAB:
En Python:
</p>





<p>
15
</p>

<p>
Análisis de sistemas dinámicos en tiempo continuo
Condición de punto fijo:
</p>


<p>
dx
⇤
= G(x ) = 0
dt
</p>

<p>
Ejemplo 1: modelo logistico continuo
Puntos fijos
Ejemplo 2: modelo Lotka-Volterra
</p>

<p>
Puntos fijos
</p>





<p>
Ejemplo: Contagio de enfermedades
(epidemias y pandemias)
Modelo matemático SIR (contagio entre personas)
Variables
Ecuaciones
S(t): Susceptibles
diferenciales
I(t): Infectados
R(t): Recuperados
Parámetros
</p>
<pre class="example">
Nro. de contacto
</pre>


<pre class="example">
Duración de la enfermedad
</pre>


<p>
Simulaciones Runge-Kutta (1)
</p>

<p>
Susceptibles
Infectados
</p>

<p>
Simulaciones Runge-Kutta (2)
</p>

<p>
Susceptibles
Infectados
</p>

<p>
Simulaciones en Matlab (1)
Código MATLAB: link Github
</p>

<p>
Definición de Modelo SIR
</p>

<p>
Método de Euler
</p>

<p>
Simulaciones en Matlab (2)
Código MATLAB: link Github
</p>

<p>
Método de Runge Kutta Orden 4
</p>

<p>
Simulaciones en Matlab (3)
Ejemplo de código para la simulación modelo SIR
</p>

<p>
Código MATLAB: link Github
</p>

<p>
Casos de estudio más complejos
• Propagación de Malaria
“A Multipatch Malaria Model with Logistic Growth Populations”,
Gao, D. and Ruan, S., SIAM J. App. Math., 72 (3), 2012.
</p>
<ol class="org-ol">
<li>Vector de contagio = mosquito</li>
<li>Se considera un modelo con ecuaciones diferenciales en</li>
</ol>
<p>
multiples zonas geográficas (multipatch).
</p>
<ol class="org-ol">
<li>Se estudian los efectos de las migraciones humanas.</li>
</ol>

<p>
• Efectos de la vacunación en enfermedades
“Rich Bifurcation Structure in a Two-Patch Vaccination Model
”, Knipl, D., Pilarczyk, P. and Rost, G. SIAM J. App. Dyn.
Syst., 14 (2), 2015.
</p>
<ol class="org-ol">
<li>Impacto de las migraciones entre grandes ciudades</li>
<li>Distintos tipos de evolución dependiendo del parámetro de</li>
</ol>
<p>
reproducción.
</p>
<ol class="org-ol">
<li>El parámetro de reproducción se puede controlar con un</li>
</ol>
<p>
plan de vacunación.
</p>

<p>
Linearización de Sistemas No-Lineales
</p>



<p>
23
</p>



<p>
Linearización de Sistemas No-Lineales
</p>



<p>
24
</p>



<p>
Material de Lectura
</p>
<ul class="org-ul">
<li>Material de lectura (esta clase):</li>
</ul>
<p>
Libros (Mínimo):
[2] Introduction to the Modeling and Analysis of Complex Systems - Sayama, Cap
5 y 6.
</p>

<p>
Libros (opcional):
[6] Programming for Computations – Python - Linge and Langtangen, Cap 4
[10] Introduction to Computational Science_ Modeling and Simulation for the
Sciences - Angela B. Shiflet, George W. Shiflet-(2014) , Cap 2,4 y 6
[11] Dynamical Systems with Applications using MATLAB - Stephen Lynch (2014)
[12] Essential Matlab for Engineers and Scientists - Brian Hahn and Dan Valentine
(2013), Cap 12
</p>

<ul class="org-ul">
<li>Leer para la próxima clase:</li>
</ul>
<p>
Libros (Mínimo):
[2] Introduction to the Modeling and Analysis of Complex Systems - Sayama, Cap 8.
</p>

<p>
Libros (opcional):
[11] Dynamical Systems with Applications using MATLAB - Stephen Lynch (2014), Cap 3 y 13
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
Last update: 2020-09-16 13:11
</div>
</body>
</html>
